{
  "title": "Analyzing the JWST Pipeline products of HAT-P-1b observations with NIRISS/SOSS",
  "description": "--------------------------------------------------------------\n**Author**: Néstor Espinoza (nespinoza@stsci.edu) | **Latest update**: August 23, 2020.\n\n## Table of contents\n1. [Introduction](#intro)\n2. [Spectral extraction](#extraction)\n1. [Tracing the orders](#tracing)\n2. [Extracting the spectra](#extracting)\n3. [Time-stamps and wavelength solution](#timenwavelength)\n3. [Fitting & analyzing white-light lightcurves](#white-light)\n1. [Studying the residuals](#wl-residuals)\n4. [Fitting & analyzing the wavelength-dependent lightcurves](#wavelength)\n5. [Studying the transit spectrum of HAT-P-1b](#transit-spectra)\n\n1.<font color='white'>-</font>Introduction <a class=\"anchor\" id=\"intro\"></a>\n------------------\n\nThis notebook is part of a series of notebooks that are being prepared by STScI in order to showcase how to simulate, process and analyze JWST observations for a wide range of science cases. Here, we touch on the transiting exoplanet observations science case and, in particular, on spectrophotometric observations of the *primary transit of an exoplanet*. During primary transit, the observed flux decrease due to the planet blocking light from the stellar host is proportional to $\\delta = (R_p/R_*)^2$ --- a quantity known as the *transit depth*, where $R_p$ is the planetary radius and $R_*$ is the stellar radius. Interestingly, the transit depth is wavelength dependent; i.e., $\\delta \\equiv \\delta (\\lambda)$. This is because opacity sources on the planetary atmosphere absorb different amounts of light at different wavelengths and, therefore, the observed planetary radius $R_p$ --- and thus occulted area during transit, $\\delta$ --- is wavelength-dependent (see, e.g., [Kreidberg 2018](https://ui.adsabs.harvard.edu/abs/2018haex.bookE.100K/abstract) for a review). This technique, referred to as *transmission spectroscopy* in what follows, aims at obtaining those transit depths as a function of wavelength in JWST observations through the study of ultra-precise transit lightcurves at different wavelengths.\n\nSimulated data for NIRISS/SOSS observations targeting a transit of HAT-P-1b have been generated with the help of the [`awesimsoss` simulator](https://github.com/spacetelescope/awesimsoss/) by the NIRISS team. These simulations, in turn, have been calibrated using the [JWST pipeline](https://jwst-pipeline.readthedocs.io/). HAT-P-1b is a Guaranteed Time Observations (GTO) target of the [NIRISS Exploration of the Atmospheric diversity of Transiting exoplanets (NEAT) program](https://jwst-docs.stsci.edu/jwst-opportunities-and-policies/jwst-cycle-1-guaranteed-time-observations-call-for-proposals/jwst-gto-observation-specifications/jwst-gto-niriss-observations-table), which will be observed using the [NIRISS/SOSS](https://jwst-docs.stsci.edu/near-infrared-imager-and-slitless-spectrograph/niriss-observing-modes/niriss-single-object-slitless-spectroscopy) instrument onboard JWST. This target is also used as an [example science program used in the JWST documentation](https://jwst-docs.stsci.edu/near-infrared-imager-and-slitless-spectrograph/niriss-example-science-programs/niriss-soss-time-series-observations-of-hat-p-1). If you are not familiar with transiting exoplanet observations and/or with how JWST will observe planetary transits, we encourage you to read through that example science program in order to familiarize yourself with the terminology.\n\nIn this notebook, we analyze the 2D spectral products of the JWST pipeline in order to analyze the transmission spectrum of this exoplanet. In particular, the data we take a look at here has been processed by the JWST pipeline up to the `assign_wcs` step of the pipeline's [Stage 2 processing](https://jwst-pipeline.readthedocs.io/en/latest/jwst/pipeline/calwebb_spec2.html#calwebb-spec2). The simulations didn't include flat-fielding, so we don't apply the flat-field step of the pipeline to them. Although the JWST Pipeline will eventually be able to produce white-light lightcurves, as well as extracted 1D spectra, as of the day of writing of this notebook, the JWST calibration pipeline does not have a spectral extraction algorithm that can deal with the complicated structure of NIRISS/SOSS data. In particular, the `SUBSTRIP256` subarray has data from at least two NIRISS/SOSS orders, which overlap at the reddest wavelengths. An algorithm to properly extract this data is in-the-making, but in this notebook we will be performing our own tracing and extraction of the spectra in order to showcase how to analyze the JWST pipeline products. After extracting the spectrum, we will generate the white-light lightcurves of each order, fit them and compare the extracted parameters to the ones in the literature. Then, we will repeat the procedures for the wavelength-dependent lightcurves, with which we will get the transmission spectrum of the exoplanet.\n\nBefore we begin, let's import some libraries:"
}