{
  "title": null,
  "description": "**Use case:** Extract spatial-spectral features from IFU cube and measure their attributes.<br>\n **Data:** KMOS datacube of point sources in the LMC from Jones et al. (in prep).<br>\n **Tools:** specutils, spectral_cube, photutils, astropy, aplpy, scipy.<br>\n **Cross-intrument:** MIRI<br>\n **Documentation:** This notebook is part of a STScI's larger [post-pipeline Data Analysis Tools Ecosystem](https://jwst-docs.stsci.edu/jwst-post-pipeline-data-analysis).<br>\n \n **Note**: Ultimately, this notebook will include MIRI simulated data cubes obtained using MIRISim (https://wiki.miricle.org//bin/view/Public/MIRISim_Public)\n and run through the JWST pipeline (https://jwst-pipeline.readthedocs.io/en/latest/) of\n point sources with spectra representative of late M type stars.\n \n ## Introduction\n \n This notebook analyzes one star represented by a dusty SED corresponding to the ISO SWS spectrum of\n W Per from Kraemer et al. (2002) and Sloan et al. (2003) to cover the MRS spectral range 5-28 microns.  Analysis of JWST spectral cubes requires extracting spatial-spectral features of interest and measuring their attributes. \n \n The first part of the notebook will process the datacube and automatically detect and extract spectra (summed over its spatial region) for all point sources in the cube.  Then it will read in a datacube generated at Stage 3 of the JWST pipeline or use near-IR data from KMOS as a representative example of an IR data cube.  The analysis will use `photutils` to automatically detect sources in the continuum image and use an aperture mask generated with `spectral-cube` to extract the spectra of each point source in the data cube.\n \n The second part of the notebook will perform data analysis using `specutils`.  Specifically, it will fit a model photosphere/blackbody to the spectra.  Then it will calculate the centroids, line integrated flux and equivalent width for each dust and molecular feature. \n \n ## To Do:\n - Replace KMOS data cube with JWST/MIRI simulation of an M star ran through JWST piplieline.\n - Make function to extract spectra from datacube using an apeture.\n - Replace blackbody fit to the photosphere part of the spectra with a stellar photosphere model.\n - Make sure errors have been propagated correctly in the caculation of centroids, line integrated flux and\n equivalent widths.\n - Make simple function within the `specutils` framework to fit a continium and measure centroids, line integrated flux and\n equivalent widths of broad solid state and molecular features."
}