{
  "title": "NIRCam PSF-matched multiband photometry",
  "description": "**Use case:** Measure galaxy photometry in an extragalactic \"blank\" field. Related to [JDox Science Use Case #22](https://jwst-docs.stsci.edu/near-infrared-camera/nircam-example-science-programs/nircam-deep-field-imaging-with-miri-imaging-parallels).<br>\n **Data:** JWST simulated NIRCam images from [JADES JWST GTO extragalactic blank field](http://fenrir.as.arizona.edu/jwstmock/).<br>\n (Williams et al. 2018) https://ui.adsabs.harvard.edu/abs/2018ApJS..236...33W.<br>\n **Tools:**  photutils, matplotlib.<br>\n **Cross-intrument:** potentially NIRISS, MIRI.<br>\n **Documentation:** This notebook is part of a STScI's larger [post-pipeline Data Analysis Tools Ecosystem](https://jwst-docs.stsci.edu/jwst-post-pipeline-data-analysis).<br>\n \n ## Introduction\n \n This notebook uses `photutils` to detect objects/galaxies in NIRCam deep imaging.  Detections are first made in a F200W image, then isophotal photometry is obtained in all 9 filters (F090W, F115W, F150W, F200W, F277W, F335M, F356W, F410M, F444W). PSF-matching is used to correct photometry measured in the Long Wavelength images (redder than F200W). \n \n After saving the photometry catalog, the notebook demonstrates how one would load the notebook in a new session. \n It demonstrates some simple analysis of the full catalog and on an individual galaxy. \n By comparing the measured colors to simulated input colors,\n it shows the measurements are more accurate after PSF corrections, though they could be improved further.\n \n The notebook analyzes only the central 1000 x 1000 pixels (30\" x 30\") of the full JADES simulation. These cutouts have been staged at STScI with permission from the authors (Williams et al.).\n \n **NOTES:** \n * This is a work in progress. More accurate photometry may be obtainable.\n \n * These JADES images are simulated using [Guitarra](https://github.com/cnaw/guitarra),\n not [MIRAGE](https://github.com/spacetelescope/mirage).\n They have different properties and units (e-/s) than JWST pipeline products (MJy/sr).\n \n * All images are aligned to the same 0.03\" pixel grid prior to analysis. This alignment can be done using [`reproject`](https://reproject.readthedocs.io), if needed.\n \n * The flux uncertainty calculations could be improved further by accounting for correlated noise and/or measuring the noise in each image more directly."
}